БухЭксп/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСДо2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСНаСчете19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПоОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПриПередачеНедвижимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДолюВычета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезопаснаяДоляВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСБезВычетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРегистрацииСводныхСправок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СчетаФактурыНалоговыхАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СчетаФактурыНалоговыхАгентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВедущийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ДоходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ДоходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Comment>Актируемый счёт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеестрыНДС0Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_БухгалтерияЭкспедитораДляРоссииСервер/Ext/Module.bsl
// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт
	
	ОписаниеПодсистем.Вставить("CW_БухгалтерияЭкспедитораДляРоссии", "8.3.18.2");
	
	//CW_РеестрыНДС0
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда  
		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
		Если Модуль_CW_РеестрыНДС0Сервер <> Неопределено Тогда
			Модуль_CW_РеестрыНДС0Сервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
		КонецЕсли;
	КонецЕсли; 	 
	//CW_РеестрыНДС0  
	
  	//CW_ДоходыНерезидентов
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда  
		Модуль_CW_ДоходыНерезидентовСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ДоходыНерезидентовСервер");
		Если Модуль_CW_ДоходыНерезидентовСервер <> Неопределено Тогда
			Модуль_CW_ДоходыНерезидентовСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
		КонецЕсли;
	КонецЕсли; 	 
	//CW_ДоходыНерезидентов
	
	//CW_ОбменГИСЭПД
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ОбменГИСЭПД") Тогда  
		Модуль_CW_ОбменГИСЭПДСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ОбменГИСЭПДСервер");
		Если Модуль_CW_ОбменГИСЭПДСервер <> Неопределено Тогда
			Модуль_CW_ОбменГИСЭПДСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
		КонецЕсли;
	КонецЕсли; 	 
	//CW_ОбменГИСЭПД
	
КонецПроцедуры   

Функция РекомендуемаяВерсияБухгалтерияПредприятия() Экспорт
	
	Возврат "3.0.198.19";
	
КонецФункции   

Функция ИмяОсновнойПодсистемы() Экспорт   
	
	Возврат "CW_БухгалтерияЭкспедитораДляРоссии"; 
	
КонецФункции  

Функция ИмяТекущейКонфигурации() Экспорт
	
	Возврат "Бухгалтерия экспедитора 8";

КонецФункции

Функция ПолучитьКороткоеИмяКонфигурации() Экспорт
	
	Возврат "AF8";     
	
КонецФункции      

Функция ПолучитьИмяФайлаUpdInfo() Экспорт  
	
	Возврат "AFUpdInfo.txt";	
	
КонецФункции  

Функция ПолучитьИмяФайлаУведомлений() Экспорт  
	
	Возврат "AFMessage.txt";	
	
КонецФункции  

Функция ПолучитьИмяФайлаNew() Экспорт
	
	Возврат "NewAF8.pdf";	
	
КонецФункции

Функция ПолучитьИмяФормыБанковскиеВыписки() Экспорт
	
	Возврат "ЖурналДокументов.Деньги.Форма.БанковскиеВыписки";	
	
КонецФункции   

Функция ПолучитьЗначениеНациональнойВалюты() Экспорт

	НациональнаяВалюта = Справочники.Валюты.НайтиПоКоду("643");
	
	Если НациональнаяВалюта.Пустая() тогда
		НациональнаяВалюта = Справочники.Валюты.НайтиПоКоду("RUB");
	КонецЕсли;
	
	Возврат НациональнаяВалюта;

КонецФункции

Функция ПолучитьУпрощенныеСистемыНалогообложения() Экспорт
	
	МассивУпрощенная = Новый Массив;
	МассивУпрощенная.Добавить(ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.АУСН"));
	МассивУпрощенная.Добавить(ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная"));
	
	Возврат МассивУпрощенная;
	
КонецФункции      

Функция ПолучитьСистемуНалогообложения(Организация, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиСистемыНалогообложенияСрезПоследних.Организация КАК Организация,
	               |	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СистемаНалогообложения;
	КонецЕсли;
	
КонецФункции   

Функция ПолучитьНДСДляУСН(Организация, Дата) Экспорт

	//5% (при доходе до 250 млн рублей)(0), 
	//7% (при доходе до 450 млн рублей)(1), 
	//20% (при доходе свыше 450 млн рублей или добровольно, с правом на вычет)(2)
	
	СоответствиеСтавок = Новый Соответствие;
	СоответствиеСтавок.Вставить(0, ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5"));
	СоответствиеСтавок.Вставить(1, ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7"));
	СоответствиеСтавок.Вставить(2, ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));  
	
	СтавкаНалогообложенияПриУСН = СтавкаНалогообложенияПриУСН(Организация, Дата);
	ИндексСтавкиНДС = НастройкиСистемыНалогообложенияФормы.ИндексСтавкиНДСПоЗначению(СтавкаНалогообложенияПриУСН);
	
	СтавкаНДС = СоответствиеСтавок.Получить(ИндексСтавкиНДС);
	Если СтавкаНДС = Неопределено Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции  

Функция СтавкаНалогообложенияПриУСН(Организация, Дата)
	
	// Получим значение ставки НДС в следующем году
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецГода", 	 КонецГода(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН КАК СтавкаНалогообложенияПриУСН
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.Период > &КонецГода
	|	И НастройкиУчетаНДС.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиУчетаНДС.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНалогообложенияПриУСН;
	КонецЕсли;

	Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	
КонецФункции



Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт    
	
	
КонецПроцедуры

Функция ПолучитьМассивИННОрганизаций() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.ИНН КАК ИНН
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|СГРУППИРОВАТЬ ПО
	|	Организации.ИНН"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИНН");
	
КонецФункции

Функция МассивКонтрольныхСчетов() Экспорт
	
	МассивКонтрольныхСчетов = новый Массив;       
	МассивКонтрольныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);
	МассивКонтрольныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);
		
	Возврат МассивКонтрольныхСчетов;
	
КонецФункции

Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт 
	
	// Если в качестве базовой валюты установлены рубли, то  
	// при пересчеты в рубли курс должен умножаться на валюту, 
	// т.к. ЦБ РФ дает котировки не за 1 руб., а за 1 ед.валюты.
	// Если в качестве базовой валюты установлена иная валюта,
	// то для пересчета в эту валюту валютный эквивалент должен делиться на курс,
	// т.к. иностранные биржы дают котировки относительно своей валюты. 
	
	ПараметрыТекущегоКурса = РаботаСКурсамиВалютБПКлиентСервер.ПараметрыПересчетаКурса(
	ВалютаНач, ПоКурсуНач, ПоКратностьНач);
	ПараметрыНовогоКурса = РаботаСКурсамиВалютБПКлиентСервер.ПараметрыПересчетаКурса(
	ВалютаКон, ПоКурсуКон, ПоКратностьКон);
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
			
КонецФункции

Функция ИтогиДинамическогоСписка(ДинамическийСписок, ИменаПолейИтогов) Экспорт 
	Возврат  ОбщегоНазначенияБП.ИтогиДинамическогоСписка(ДинамическийСписок, ИменаПолейИтогов);
КонецФункции 

Функция ПолучитьСтавкуНДС(ПараметрыФункции) Экспорт
	
	ПодставлятьСтавкуНДС = ?(ПараметрыФункции.Свойство("ПодставлятьСтавкуНДС"),ПараметрыФункции.ПодставлятьСтавкуНДС,Ложь);
	
	Если ПодставлятьСтавкуНДС Тогда
		СтавкаНДС = СтавкаНДС(ПараметрыФункции.Номенклатура, ПараметрыФункции.Дата);
	Иначе
		ДатаСтавки = ?(ПараметрыФункции.Дата = Неопределено, ТекущаяДата(), ПараметрыФункции.Дата);
		Если ПараметрыФункции.ТипДвижения = "ДОХОДЫ" Тогда 
			СтавкаНДС = УчетНДСКлиентСервер.СтавкаНДСПриРеализации(ДатаСтавки, ПараметрыФункции.Организация);
		КонецЕсли;  
		
		Если ПараметрыФункции.ТипДвижения = "РАСХОДЫ" Тогда 
			Если ПараметрыФункции.Договор.БухгалтерскийУчет 
				И ЗначениеЗаполнено(ПараметрыФункции.Договор.УчетныйДоговор) Тогда
				СтавкаНДС = ПараметрыФункции.Договор.УчетныйДоговор.СтавкаНДС;  
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
				СтавкаНДС = СтавкаНДС(ПараметрыФункции.Номенклатура, ДатаСтавки);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда  
		СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;	
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции 

Функция СтавкаНДС(Знач Номенклатура, Знач Дата=Неопределено) Экспорт 

	Дата = ?(Дата=Неопределено, ТекущаяДата(), Дата);
	
	Возврат Справочники.Номенклатура.СтавкаНДС(Номенклатура, Дата);
	
КонецФункции  

Функция СтавкаНДСПоВидуСтавки(ВидСтавкиНДС, Дата) Экспорт	
	
	Возврат Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС, Дата);
	
КонецФункции 

Функция ПараметрыУчетнойПолитикиБП(Организация, Дата) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыУчетнойПолитики = Новый Структура("СистемаНалогообложения,ДатаПереходаНаУСН,ОбъектНалогообложенияУСН,РаздельныйУчетНДСНаСчете19,СложныйУчетНДС,ПлательщикНДСПрименяющийУСН"); 
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ПараметрыУчетнойПолитики;
	КонецЕсли;
	
	ТЗНастройкиНалогообложения = НастройкиУчета.УчетнаяПолитикаНалоговыйУчет(Дата,Организация);
	Если ТЗНастройкиНалогообложения <> Неопределено Тогда
		НастройкиНалогообложения = ТЗНастройкиНалогообложения[0];
		ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения",НастройкиНалогообложения.СистемаНалогообложения);
		ПараметрыУчетнойПолитики.Вставить("ДатаПереходаНаУСН",НастройкиНалогообложения.ДатаПереходаНаУСН);
		ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН",НастройкиНалогообложения.ОбъектНалогообложенияУСН);  
		ПараметрыУчетнойПолитики.Вставить("ПлательщикНДСПрименяющийУСН",НастройкиНалогообложения.ПлательщикНДСПрименяющийУСН);
	Иначе
		Сообщить("Не задана учётная политика по налогообложению");
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.УпрощенныйУчетНДС,
	|	НастройкиУчетаНДССрезПоследних.РаздельныйУчетНДСНаСчете19,
	|	НастройкиУчетаНДССрезПоследних.СложныйУчетНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	НастройкиНДС = _сф.ВыполнитьЗапрос(Запрос,,Истина);
	Если (НастройкиНДС <> Неопределено) Тогда
		ПараметрыУчетнойПолитики.Вставить("РаздельныйУчетНДСНаСчете19",НастройкиНДС.РаздельныйУчетНДСНаСчете19);
		ПараметрыУчетнойПолитики.Вставить("СложныйУчетНДС",НастройкиНДС.СложныйУчетНДС);
	Иначе
		ПараметрыУчетнойПолитики.Вставить("РаздельныйУчетНДСНаСчете19",Ложь);
		ПараметрыУчетнойПолитики.Вставить("СложныйУчетНДС",Ложь);
	КонецЕсли; 
	
	Возврат ПараметрыУчетнойПолитики;

КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораСтавкиНДС(Объект, ИмяРеквизитаСтавкаНДС) Экспорт 
	
	УчетНДС.УстановитьПараметрыВыбораСтавкиНДС(Объект, ИмяРеквизитаСтавкаНДС);

КонецПроцедуры      

Процедура ЗаполнитьСписокКодовВидовОпераций(ЧастьЖурнала, СписокВыбора, ДатаЗаполнения) Экспорт

	СписокВыбора.Очистить();

	УчетНДС.ЗаполнитьСписокКодовВидовОпераций(
		ЧастьЖурнала, 
		СписокВыбора,
		ДатаЗаполнения);
	
КонецПроцедуры

	
Функция РаздельныйУчетНДСНаСчете19(Организация, Дата) Экспорт
	
	Возврат	УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	
КонецФункции    

Функция КонтрагентРезидентТаможенногоСоюза(Контрагент) Экспорт   
	
	Возврат Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Контрагент);
	
КонецФункции  

Функция СведенияОЮрФизЛице(ЮрФизЛицо, ДатаСреза) Экспорт
	
	Возврат БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ЮрФизЛицо, ДатаСреза);
	
КонецФункции


Функция ПолучитьПараметрыФормыКорректировкиДвижений(ПараметрКоманды) Экспорт
	
	Возврат Новый Структура("ДокументДвижений", ПараметрКоманды);

КонецФункции

Функция ВерсияПостановленияНДС1137(ДатаДляПостановления) Экспорт

	Возврат УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПостановления);

КонецФункции

Функция ВедетсяУчетНДСПоФЗ56(Дата) Экспорт    
	
   Возврат УчетНДС.ВедетсяУчетНДСПоФЗ56(Дата) И Константы.ИспользуетсяГособоронзаказ.Получить();

КонецФункции

Процедура ЗаполнитьДоступныеСервисы(ДоступныеСервисы) Экспорт
	
	ДоступныеСервисы.ЛичныйКабинет = Истина;
	ДоступныеСервисы.РеестрыНДС0 = Истина;
	ДоступныеСервисы.ДоходыНерезидентов = Истина;
	
КонецПроцедуры


Процедура СоздатьДокументыСчетФактураВыданныйСВидомНалоговыйАгент(Объект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СчетаФактурыНалоговыхАгентов.Контрагент КАК Контрагент,
	|	CW_СчетаФактурыНалоговыхАгентов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура КАК СчетФактура
	|ИЗ
	|	РегистрСведений.CW_СчетаФактурыНалоговыхАгентов КАК CW_СчетаФактурыНалоговыхАгентов
	|ГДЕ
	|	CW_СчетаФактурыНалоговыхАгентов.ВедущийДокумент = &ВедущийДокумент";  
	
	Запрос.УстановитьПараметр("ВедущийДокумент", Объект.Ссылка);
	
	РезультатСчетаФактурыНалоговогоАгента 	= Запрос.Выполнить();
	ВыборкаСчетаФактурыНалоговогоАгента 	= РезультатСчетаФактурыНалоговогоАгента.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкам.ДокументРасходов.Контрагент КАК Поставщик,
	|	ВЫБОР
	|		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫлка)
	|			ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументРасходов.Договор.УчетныйДоговор
	|		ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументРасходов.ПриложениеКДоговору.УчетныйДоговор
	|	КОНЕЦ КАК УчетныйДоговор,
	|	ВЫБОР
	|		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫлка)
	|			ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументРасходов.Договор
	|		ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументРасходов.ПриложениеКДоговору
	|	КОНЕЦ КАК ДоговорПриложение,
	|	CW_ДоходыПоГрузоперевозкам.СтавкаНДС КАК СтавкаНДС,
	|	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма,
	|	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС,
	|	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего
	|ПОМЕСТИТЬ ВТ_Перевыставления
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкам.Регистратор = &Регистратор
	|	И CW_ДоходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление)
	|	И CW_ДоходыПоГрузоперевозкам.СтавкаНДС <> Значение(Перечисление.СтавкиНДС.БезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Перевыставления.Поставщик КАК Поставщик,
	|	ВТ_Перевыставления.УчетныйДоговор КАК УчетныйДоговор,
	|	ВТ_Перевыставления.УчетныйДоговор.НаименованиеДляСчетаФактурыНаАванс КАК Номенклатура,
	|	ВТ_Перевыставления.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_Перевыставления.Сумма) КАК Сумма,
	|	СУММА(ВТ_Перевыставления.НДС) КАК НДС,
	|	СУММА(ВТ_Перевыставления.Всего) КАК Всего
	|ИЗ
	|	ВТ_Перевыставления КАК ВТ_Перевыставления
	|ГДЕ
	|	ВТ_Перевыставления.ДоговорПриложение.БухгалтерскийУчет = ИСТИНА
	|	И ВТ_Перевыставления.УчетныйДоговор.УчетАгентскогоНДС = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Перевыставления.Поставщик,
	|	ВТ_Перевыставления.УчетныйДоговор,
	|	ВТ_Перевыставления.СтавкаНДС,
	|	ВТ_Перевыставления.УчетныйДоговор.НаименованиеДляСчетаФактурыНаАванс"; 
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Объект.Организация, Объект.Дата);
	
	Выборка = РезультатЗапроса.Выбрать();   

	Пока Выборка.Следующий() Цикл  
		
		Отбор = Новый Структура;
		Отбор.Вставить("Контрагент", 			Выборка.Поставщик);
		Отбор.Вставить("ДоговорКонтрагента", 	Выборка.УчетныйДоговор); 
		
		СчетФактураНалоговогоАгентаСсылка = Неопределено;
		
		ВыборкаСчетаФактурыНалоговогоАгента.Сбросить();
		Если ВыборкаСчетаФактурыНалоговогоАгента.НайтиСледующий(Отбор) Тогда
			СчетФактураНалоговогоАгентаСсылка = ВыборкаСчетаФактурыНалоговогоАгента.СчетФактура;	
		КонецЕсли;
		
		Если СчетФактураНалоговогоАгентаСсылка <> Неопределено Тогда
			СчетФактураНалоговогоАгента = СчетФактураНалоговогоАгентаСсылка.ПолучитьОбъект();   
		Иначе
			СчетФактураНалоговогоАгента = Документы.СчетФактураВыданный.СоздатьДокумент();
			СчетФактураНалоговогоАгента.ВидСчетаФактуры 	= ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент");
			СчетФактураНалоговогоАгента.КодВидаОперации 	= "06";
			СчетФактураНалоговогоАгента.Руководитель 		= ОтветственныеЛица.Руководитель;
			СчетФактураНалоговогоАгента.ГлавныйБухгалтер 	= ОтветственныеЛица.ГлавныйБухгалтер;
			СчетФактураНалоговогоАгента.ДокументОснование 	= Объект.ВедомыйДокумент;
		КонецЕсли;
		
		СчетФактураНалоговогоАгента.Дата 				= Объект.ДатаСчетаФактуры;                                                                        
		СчетФактураНалоговогоАгента.Организация 		= Объект.Организация;
		СчетФактураНалоговогоАгента.Контрагент 			= Выборка.Поставщик;
		СчетФактураНалоговогоАгента.ДоговорКонтрагента 	= Выборка.УчетныйДоговор;
		
		СчетФактураНалоговогоАгента.Авансы.Очистить();
		
		СтрокаАвансы = СчетФактураНалоговогоАгента.Авансы.Добавить();
		СтрокаАвансы.Номенклатура 	= Выборка.Номенклатура; 
		СтрокаАвансы.Содержание 	= СокрЛП(Выборка.Номенклатура); 
		
		СтрокаАвансы.СтавкаНДС 	= Выборка.СтавкаНДС; 
		СтрокаАвансы.Сумма 		= Выборка.Всего; 
		СтрокаАвансы.СуммаНДС 	= Выборка.НДС; 
		
		Попытка
			СчетФактураНалоговогоАгента.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СчетФактураНалоговогоАгента.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки; 
		
		ИзмеренияРегистра = Новый Структура;
		ИзмеренияРегистра.Вставить("ВедущийДокумент", 		Объект.Ссылка);
		ИзмеренияРегистра.Вставить("Контрагент", 			Выборка.Поставщик);
		ИзмеренияРегистра.Вставить("ДоговорКонтрагента", 	Выборка.УчетныйДоговор); 
		ИзмеренияРегистра.Вставить("СчетФактура", 			СчетФактураНалоговогоАгента.Ссылка); 
		
		РегистрыСведений.CW_СчетаФактурыНалоговыхАгентов.ДобавитьЗаписьВедомыеДокументы(ИзмеренияРегистра);
		
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		СчетФактура = Объект.ВедомыйСчетФактура.ПолучитьОбъект();
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СчетФактура.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;                  
	КонецЕсли;
	
	
КонецПроцедуры
